{
    "name": "account login cluster",
    "description": "This cluster provides commands that facilitate user account login on a Content App or a node. For example, a Content App running on a Video Player device, which is represented as an endpoint (see [TV Architecture]), can use this cluster to help make the user account on the Content App match the user account on the Client.",
    "propertiesInfo": [],
    "commands": [
        {
            "epcOrId": "0x00",
            "name": "Get Setup P I N",
            "type": "",
            "typeId": "(-2, -2)",
            "description": "Upon receipt, the Content App checks if the account associated with the client Temp Account Identifier Rotating ID is the same acount that is active on the given Content App. If the accounts are the same, then the Content App includes the Setup PIN in the GetSetupPIN Response.",
            "isRequired": [
                true
            ],
            "dataInfo": null
        },
        {
            "epcOrId": "0x02",
            "name": "Login",
            "type": "",
            "typeId": "(-2, -2)",
            "description": "Upon receipt, the Content App checks if the account associated with the client’s Temp Account Identifier (Rotating ID) has a current active Setup PIN with the given value. If the Setup PIN is valid for the user account associated with the Temp Account Identifier, then the Content App MAY make that user account active.",
            "isRequired": [
                true
            ],
            "dataInfo": null
        },
        {
            "epcOrId": "0x03",
            "name": "Logout",
            "type": "",
            "typeId": "(-2, -2)",
            "description": "The purpose of this command is to instruct the Content App to clear the current user account. This command SHOULD be used by clients of a Content App to indicate the end of a user session.",
            "isRequired": [
                true
            ],
            "dataInfo": null
        },
        {
            "epcOrId": "0x01",
            "name": "Get Setup P I N Response",
            "type": "",
            "typeId": "(-2, -2)",
            "description": "This message is sent in response to the GetSetupPIN Request, and contains the Setup PIN code, or null when the accounts identified in the request does not match the active account of the running Content App.",
            "isRequired": [
                true
            ],
            "dataInfo": null
        }
    ],
    "nameMatterExact": "Account Login"
}